{
  "books": [
    {
      "id": "book_soup_twice",
      "title": "The Day We Invented Soup Twice",
      "author": "Engineer Vane Crew",
      "tags": ["History", "Engineers"],
      "pages": [
        {
          "text": "We were having a good day, which in Vane's well-town means nobody screamed before noon.\n\nThe pump was behaving. The intake wasn't singing. The glare off the salt had only made two people nauseous instead of five. Jori even found a crate in the fused district marked BEANS-the kind of word you only see in old-world relics and children's books.\n\nWe carried it back like a shrine. Forewoman Ressa Vane watched us set it down and said, \"If this is another box of screws labeled BEANS I'm promoting you all to bait.\"\n\nIt wasn't screws.\n\nIt was beans.",
          "illustration": "   _____\n  /     \\\n | BEANS |\n |_______|"
        },
        {
          "text": "We cheered-quietly, because the Steppe hates loud happiness and we've learned not to challenge it. Someone rang the dinner pipe anyway. Half the town came out with cups like we were about to receive communion. Even one Mirror Monk wandered over, pretending it was just curiosity and not the smell of mercy.\n\nThe first pot went on. The second pot too, because we're Engineers and redundancy is faith with math.\n\nThen we realized nobody knew how to open the crate without cracking the beans.\n\n\"Optics cutter,\" I suggested.\n\n\"Too delicate,\" said Jori.\n\n\"Explosives?\" asked someone from the salvage crew with the eager eyes of a person who misses problems.",
          "illustration": "   _____\n  /     \\\n |  ? ?  |\n |_______|"
        },
        {
          "text": "Vane came over, stared at the box, and produced a pry bar like it had been waiting in her spine all along. She wedged it under the lid and leaned. The lid groaned and gave. We all clapped like she'd just repaired the sun.\n\nInside: twenty jars. Sealed. Perfect.\n\nNone of us had a jar opener.\n\nWe tried cloth. We tried heat. We tried cursing in five dialects. The Monk offered to \"adjust the angle of our approach,\" which is a polite way of saying he wanted to stand there and be useful without admitting he enjoyed it.\n\nFinally, Vane held up a jar, squinted at the ridges, and said, \"Fine. We'll invent soup twice.\"",
          "illustration": "   _____\n  /     \\\n | OPEN! |\n |_______|"
        },
        {
          "text": "She took the jar outside and hammered the lid against a stone until it gave. Beans, brine, and a bit of old-world vinegar smell splashed into the dust.\n\nWe cooked it anyway. We ate it anyway. People laughed. Someone said it tasted like the past apologizing.\n\nThat night, the glass storm came early-six turns ahead of forecast. It rotated the whole east block so our mess hall door opened into a dead stairwell full of cyan *. We didn't lose anyone. We just lost the route to the salvage yard, the south brine line, and-strangest-half our laughter, as if it had been stored in a room the Steppe decided to erase.",
          "illustration": "   _____\n  /     \\\n | EMPTY |\n |_______|"
        },
        {
          "text": "In the morning, Vane wrote on the ration board:\n\n- SOUP: SUCCESS.\n- HAPPINESS: NONRENEWABLE RESOURCE. USE SPARINGLY.\n\nWe ate the last beans by candlelight, because glare makes you remember you're visible.",
          "illustration": "   _____\n  /     \\\n |  FIN  |\n |_______|"
        }
      ]
    },
    {
      "id": "book_wedding_refractions",
      "title": "A Wedding in Three Refractions",
      "author": "Glassborn Collective",
      "tags": ["Culture", "Glassborn"],
      "pages": [
        {
          "text": "We held the wedding at a seam that only exists when the sun is low and the salt is still. Sable-of-the-Seam officiated, which sounds grand until you know Glassborn ceremonies: the officiant mostly makes sure the couple doesn't step into a corridor that wasn't there ten minutes ago.\n\nThe groom's left eye refracted into a soft prism when he smiled. The bride's skin had that faint, brave shimmer like a blade kept clean. Their families arrived in mismatched scarves and borrowed veils, pretending the veils were fashion and not camouflage.",
          "illustration": "   /\\\n  /  \\\n /    \\\n/______\\"
        },
        {
          "text": "Someone brought Storm Glass as a gift-the kind that hums when you hold it, like it remembers music. Someone else brought a jar of preserved peaches, which we treated with more awe than the glass, because sweetness is rarer than miracle out here.\n\nWe decorated with mirror-shards set into the salt in a wide circle. It looked like a crown laid down on the earth. The joke was that the Steppe finally had something it couldn't rotate: a promise.",
          "illustration": "   /\\\n  /  \\\n / <> \\\n/______\\"
        },
        {
          "text": "Sable began, as Pathspeakers do, with humor that hides instruction.\n\n\"We are gathered,\" Sable said, \"because these two have agreed to share water, shade, and blame.\"\n\nLaughter. Real laughter-sharp enough to cut glass dust out of the throat.\n\nSable continued. \"Also because they have agreed not to pretend their faces will stay the same.\"\n\nThe bride nodded, grinning. \"My face is overrated.\"\n\n\"Your face is under warranty,\" someone called, and everyone laughed again, because it's funny when you say it fast and horrifying when you say it slowly.",
          "illustration": "   /\\\n  /  \\\n / :) \\\n/______\\"
        },
        {
          "text": "They exchanged vows. Not grand ones. Practical ones.\n\n\"I will not flinch,\" the groom promised, \"when the Steppe edits you.\"\n\n\"I will not call you monster,\" the bride promised, \"when the old world calls you unauthorized.\"\n\nSable tied their wrists with a strip of cloth stained faintly blue from veilleaf. \"So you remember,\" Sable said, \"that Veil Tincture hides you from drones, not from each other.\"\n\nThen we ate peaches. Then we danced carefully, because the seam's floor was beautiful and full of sharp opinions.",
          "illustration": "   /\\\n  /  \\\n / <3 \\\n/______\\"
        },
        {
          "text": "At the height of it, a child asked why we didn't invite the unmarked town nearby.\n\nSable answered gently, still smiling. \"We did. They declined.\"\n\nThat wasn't the whole truth. The whole truth was that the last time the Glassborn hosted a celebration near that town, the town sent \"watchers.\" The watchers brought rope. They said it was for safety. They said it was for containment. They said many words that mean the same thing when you've heard them often enough.\n\nSo we danced anyway. We made the night bright on purpose.",
          "illustration": "   /\\\n  /  \\\n / !! \\\n/______\\"
        },
        {
          "text": "And when the storm came-only a small edit, more a punctuation than a sentence-it didn't take anyone.\n\nIt just turned the crown of mirror-shards into a corridor pointing east, as if the Steppe wanted to remind us: even your joy is a route out.\n\nThe couple kissed. Everyone cheered.\n\nIn the morning, they left together, hand in hand, walking the corridor the Steppe had made from their wedding decorations.\n\nWe called it a blessing because we needed a word that wasn't grief.",
          "illustration": "   /\\\n  /  \\\n / -> \\\n/______\\"
        }
      ]
    },
    {
      "id": "book_merchant_memories",
      "title": "The Merchant of Memories",
      "author": "Folktale",
      "tags": ["Folklore", "Trade"],
      "pages": [
        {
          "text": "There was once a trader named Oryn who dealt not in salt or glass, but in the things people wanted to forget.\n\nHe carried a set of Mnemosyne Lenses, rare artifacts from the deep Archives. If you looked through them and focused on a memory-a pain, a loss, a fear-the lens would pull it out of your mind and trap it in a small crystal bead.",
          "illustration": "  (   )\n (  *  )\n  (   )"
        },
        {
          "text": "A mother who lost her child to a storm came to him. \"Take the grief,\" she said. Oryn took it. She left smiling, but she also forgot she ever had a child. She walked past her son's grave without pausing.\n\nA warrior who fled a battle in cowardice came to him. \"Take the shame,\" he said. Oryn took it. The warrior became brave, reckless. He died a week later charging a Shard Spider nest, having forgotten the fear that keeps men alive.",
          "illustration": "  (   )\n (  !  )\n  (   )"
        },
        {
          "text": "One day, a Mirror Monk came to Oryn. The Monk was old, his skin crusted with beautiful, terrible jewels of refraction.\n\n\"Take the light,\" the Monk whispered. \"I have seen too much. The song of the Heliograph never stops. I want silence.\"\n\nOryn hesitated. To take a Monk's connection to the light was to take his soul. But the payment offered was a map to a pristine, pre-Collapse vault. Greed won.",
          "illustration": "  (   )\n (  $  )\n  (   )"
        },
        {
          "text": "Oryn raised the lens. He pulled the light from the Monk's mind. The bead that formed was blindingly bright, hot as a coal.\n\nThe Monk slumped, his eyes going dull and flat. He was silent. He was empty.\n\nBut the bead... the bead didn't stop growing. It fed on the ambient light of the market. It pulsed. It sang.",
          "illustration": "  (   )\n ( *** )\n  (   )"
        },
        {
          "text": "Oryn tried to put it in his pouch, but it burned through the leather. It burned through his table. It burned through the floor.\n\nThe bead became a seed. The seed became a storm.\n\nThey say the market at Oryn's Rest is still there, frozen in a perfect, eternal explosion of glass. And at the center, trapped in the amber of the storm, is Oryn, holding a lens, trying to sell a memory that was too heavy to carry.",
          "illustration": "  (   )\n ( @@@ )\n  (   )"
        }
      ]
    },
    {
      "id": "book_echoes_sector_7",
      "title": "The Echoes of Sector 7",
      "author": "Recovered Audio Log",
      "tags": ["History", "Archive"],
      "pages": [
        {
          "text": "Voice 1 (Scavenger \"Rook\"): \"Light... look at the walls. They're not reflecting us.\"\n\nVoice 2 (Tech-Specialist \"Jinx\"): \"Don't look at them. Keep your eyes on the scanner. We're looking for the server core, not art.\"\n\nRook: \"No, Jinx, seriously. Look. The reflection... it's moving independently. It's walking away.\"\n\nJinx: \"Glitch in the glass. Stress fractures. Ignore it.\"",
          "illustration": " [o_o]\n / | \\"
        },
        {
          "text": "Rook: \"It's not a glitch. It's... people. I see a crowd. They're wearing pre-Collapse clothes. Suits. Lab coats. They're running.\"\n\n[Sound of weapon safety clicking off]\n\nJinx: \"Rook, snap out of it. Your refraction index is spiking. You're hallucinating.\"\n\nRook: \"I can hear them. They're screaming about the sky burning. They're... oh god, they're trying to get in.\"\n\n[Loud thudding sound, like fists on glass]",
          "illustration": " [!_!]\n / | \\"
        },
        {
          "text": "Jinx: \"Scanner is picking up... massive data traffic. But there's no cables. It's coming from the air. The ambient light is carrying packets.\"\n\nRook: \"They aren't ghosts, Jinx. They're backups. The system backed them up when the bombs fell. They're stored in the walls.\"\n\nJinx: \"That's impossible. The storage density required...\"\n\nRook: \"They see me. The one in the red coat. He sees me. He's... he's asking for a password.\"",
          "illustration": " [?_?]\n / | \\"
        },
        {
          "text": "Jinx: \"Rook, don't answer. Do not interact with the interface.\"\n\nRook: \"He says the password is Helios. He says... he says he wants to go home.\"\n\n[High-pitched digital screech. Glass shattering.]\n\nJinx: \"Containment breach! Rook, get back! The light is leaking!\"\n\nRook: \"I see it now. It's not a city. It's a circuit board. And we're the virus.\"",
          "illustration": " [X_X]\n / | \\"
        },
        {
          "text": "[AUDIO END]\n\nNote: The bodies of Rook and Jinx were never found. Only their equipment remained, fused into the floor. The walls of Sector 7 are now completely opaque black glass.",
          "illustration": " [   ]\n /   \\"
        }
      ]
    },
    {
      "id": "book_halix_game",
      "title": "Halix's Game",
      "author": "Brother Halix",
      "tags": ["Teaching", "Monks"],
      "pages": [
        {
          "text": "Brother Halix stood in the dust of the playground, his robes heavy with salt. The children gathered, wary. They knew Monks took things—light, secrets, sometimes people.\n\n\"Today,\" Halix said, his voice like grinding stones, \"we play Storm-Statue.\"\n\nA girl raised her hand. \"Is that like Freeze Tag?\"\n\n\"No,\" Halix said. \"In Freeze Tag, you stop moving to avoid being caught. In Storm-Statue, you stop moving because if you move, the light sees you.\"",
          "illustration": "   O\n  /|\\\n  / \\"
        },
        {
          "text": "He drew a circle in the dirt. \"This is the Safe Zone. Outside is the Storm. I am the Storm.\"\n\nHe closed his eyes. \"When my eyes are closed, you run. You laugh. You are alive. When I open them...\"\n\nHe opened his eyes. They were bright, too bright, reflecting the sun with a painful intensity.\n\n\"...you become glass. If you move, you crack. If you crack, you are dust.\"",
          "illustration": "  (O)\n / | \\\n  / \\"
        },
        {
          "text": "The game began. The children ran. Halix spun, eyes snapping open. A boy stumbled. Halix pointed.\n\n\"Crack,\" he whispered.\n\nThe boy fell, pretending to shatter. He giggled.\n\nHalix did not smile. \"Do not giggle when you break. Glass does not giggle. It screams.\"\n\nThe children stopped laughing. They played harder. They froze so still they looked like the statues in the plaza.",
          "illustration": "  \\|/\n --O--\n  /|\\"
        },
        {
          "text": "For an hour, they played. Halix was relentless. He caught them mid-stride, mid-breath. He taught them to hold stillness like a weapon.\n\nWhen the bell rang, the children were exhausted, covered in dust, their eyes wide and alert.\n\n\"Good,\" Halix said. \"You are learning. The Storm does not care if you are fast. It only cares if you are visible.\"\n\nHe turned to leave. The girl called out, \"Brother Halix? Is it just a game?\"\n\nHalix looked back, his shadow long and sharp. \"Everything is a game until the sky opens. Then, it is practice.\"",
          "illustration": "   |\n  /|\\\n   |"
        }
      ]
    },
    {
      "id": "book_sister_vey",
      "title": "Vey's Margin",
      "author": "Sister Vey",
      "tags": ["Philosophy", "Monks", "Heretical"],
      "pages": [
        {
          "text": "I have found a flaw in the Litany of the Refracted Self. Verse 4, line 12: \"The light reveals the truth of the form.\"\n\nIncorrect. The light reveals the *potential* of the form. The truth is what remains when the light is gone.\n\nI tested this on a beetle. Under the focused beam of a lens, it became a jewel, a star. It was beautiful. But when I removed the light, it was just a burnt husk. The truth was ash.",
          "illustration": "   *\n  / \\\n *---*"
        },
        {
          "text": "The High Prism says my thoughts are heretical. He says I am \"clouding the clear water.\" But water is only clear when it is empty. Life is sediment. Life is murk.\n\nI watched a storm yesterday. It didn't reveal. It rewrote. It took a tree and made it a spire. It took a man and made him a memory.\n\nIf the light is divine, then God is an editor with a heavy hand.",
          "illustration": "  ~~~\n ~~~~~"
        },
        {
          "text": "I will continue my experiments. I have stolen a shard of Storm Glass. It whispers to me at night. It tells me that the Litany is backward.\n\nWe do not reflect the light.\n\nThe light reflects us.\n\nAnd it does not like what it sees.",
          "illustration": "  [?]\n  | |"
        }
      ]
    },
    {
      "id": "book_ressa_vane",
      "title": "Vane's Log",
      "author": "Forewoman Ressa Vane",
      "tags": ["Log", "Engineers"],
      "pages": [
        {
          "text": "Cycle 44. Sector 9 Excavation.\n\nWe hit a pocket of pre-Collapse air today. Sealed tight behind a bulkhead door. Jori cracked the seal and the hiss sounded like a dying lung.\n\nThe air smelled... sweet. Like flowers. Like rot. We don't have flowers anymore. Just salt-blooms and wire-grass.\n\nThree of the crew took their masks off. Said they wanted to taste the \"old world.\" Idiots.",
          "illustration": " [===]\n |   |"
        },
        {
          "text": "Within an hour, they were coughing up crystal dust. The air wasn't clean. It was saturated with dormant spores. Glass-spores.\n\nThey didn't die. I wish they had. It would have been cleaner.\n\nTheir lungs calcified. Then their throats. They stopped being able to speak, only making chiming sounds when they breathed. They became wind chimes made of meat.",
          "illustration": "  { }\n (   )\n  { }"
        },
        {
          "text": "We sealed them back in. It was the only way. You can't bring that back to the settlement. One cough and the whole barracks turns to a geode.\n\nI can still hear them chiming through the bulkhead. It sounds like music. It sounds like a warning.\n\nNote to self: Next time we find \"sweet\" air, we burn it.",
          "illustration": "  X_X"
        }
      ]
    },
    {
      "id": "book_glass_pilgrim",
      "title": "Pilgrim's Journal",
      "author": "Unknown Pilgrim",
      "tags": ["Journal", "Exploration"],
      "pages": [
        {
          "text": "Day 12. The salt is endless. My boots are shredding. I have wrapped them in strips of canvas, but the crystals bite through.\n\nI saw the Silent City today. It appeared on the horizon, shimmering like a mirage. But mirages don't cast shadows. This did.\n\nThe towers are impossible. They spiral up, defying gravity, made of glass so clear you can only see the edges.",
          "illustration": "  /|\\\n / | \\"
        },
        {
          "text": "Day 14. I reached the outskirts. The streets are paved with mirrors. I have to walk with my head down, watching my own reflection, or the glare will blind me.\n\nThere are people here. Or things that were people. They stand in the plazas, frozen in mid-gesture. Statues of perfect clarity.\n\nI touched one. It was warm. It hummed.",
          "illustration": "  | |\n  | |"
        },
        {
          "text": "Day 15. I am not alone. Something is following me. I see it in the reflections, but when I turn, there is nothing.\n\nIt is a shadow that moves against the light. A dark prism.\n\nI must leave. The City wants me to stay. It wants to add me to its collection. I feel my joints stiffening. My skin feels... brittle.\n\nI am running now. I will not be a statue. I will not be clear.",
          "illustration": "  ! !\n  \\ /"
        }
      ]
    },
    {
      "id": "book_halen_trace",
      "title": "Halen's Trace",
      "author": "Halen Trace",
      "tags": ["Warning", "Psychic"],
      "pages": [
        {
          "text": "They call it the Thought-Eater. It lives in the high frequencies of the radio band, in the static between stations.\n\nI first heard it when I was tuning the old array. A pattern in the white noise. A rhythm. It wasn't random. It was hungry.\n\nIt feeds on focus. If you listen too long, if you try to decode it, it latches on.",
          "illustration": " ~~~~\n ~~~~\n ~~~~"
        },
        {
          "text": "My brother listened. He was a decoder. The best. He wrote down the sequence: 4-4-9-1.\n\nThen he stopped writing. He stopped moving. He just sat there, listening.\n\nI tried to pull the headphones off, but his hands were locked. He was smiling. A terrible, slack smile.\n\n\"It's beautiful,\" he said. \"It's a color I've never seen.\"",
          "illustration": " (  )\n -__-"
        },
        {
          "text": "I smashed the radio. I smashed the array. The silence that followed was heavy.\n\nHe never spoke again. He eats, he sleeps, but there is no one home. The Thought-Eater took him. It ate the part of him that was *him*.\n\nNow, when the wind blows through the wires, I cover my ears. I hum. I make my own noise. Because I know it's still out there, listening for a mind that is open.",
          "illustration": "  X\n / \\"
        }
      ]
    },
    {
      "id": "book_white_noon",
      "title": "The White Noon",
      "author": "Unknown Survivor",
      "tags": ["History", "Cataclysm"],
      "pages": [
        {
          "text": "I was in the market when the sky stopped moving. The sun, usually a harsh yellow, turned a blinding, absolute white. It wasn't just bright; it was heavy. You could feel the weight of the light pressing down on your shoulders.\n\nThen the silence came. The birds stopped singing. The wind died. Even the hum of the old generators cut out. It was as if the world was holding its breath.",
          "illustration": "   O\n  /|\\\n  / \\"
        },
        {
          "text": "And then the fusing began. I saw a man running for cover. He didn't make it. The light caught him mid-stride. He didn't burn; he... stopped. His clothes, his skin, his hair—they all turned to glass in an instant. He's still there, I think. A statue of panic, perfect and clear.",
          "illustration": "  \\|/\n --O--\n  /|\\"
        },
        {
          "text": "The buildings groaned. Stone turned to liquid, then to crystal. The library melted into a prism. The streets became mirrors. I hid in a storm drain, praying to gods I didn't believe in. When I came out, the city was gone. In its place was a labyrinth of sharp edges and impossible angles. The White Noon had rewritten us.",
          "illustration": "  / \\\n /   \\\n/_____\\"
        }
      ]
    },
    {
      "id": "book_pump_manual",
      "title": "Pump Maintenance 101",
      "author": "Chief Engineer Kael",
      "tags": ["Manual", "Engineers"],
      "pages": [
        {
          "text": "Listen up, rookies. The pumps are the only reason we aren't drinking sand. Treat them better than your own mothers.\n\nRule 1: Sand gets everywhere. If you think you cleaned it, clean it again. A single grain in the intake valve can shatter the impeller. And if the impeller shatters, we all die of thirst. No pressure.",
          "illustration": " [===]\n | O |"
        },
        {
          "text": "Rule 2: Listen to the hum. A happy pump hums in B-flat. If it starts singing in F-sharp, it's misaligned. If it screams, run. That means the pressure seal is about to blow, and superheated brine is not a good skin treatment.",
          "illustration": "  /~~\n ( O )\n  \\__"
        },
        {
          "text": "Rule 3: Don't use spit to lubricate the gears. I saw Jori do it once. The salt in his spit crystallized and fused the bearing. Jori is now bait for the Glass Spiders. Don't be like Jori.",
          "illustration": "  X_X"
        }
      ]
    },
    {
      "id": "book_broken_eye",
      "title": "The Broken Eye",
      "author": "Acolyte Elara",
      "tags": ["History", "Monks", "Heretical"],
      "pages": [
        {
          "text": "The High Abbot says the Eye is perfect. He says the visions are divine. But I have seen the crack. It is microscopic, a hairline fracture near the base. But it is there.\n\nWhen the light hits it, the beam splits. It doesn't show the truth; it shows a distortion. A lie made of light.",
          "illustration": "  ( / )"
        },
        {
          "text": "I tried to tell him. He called me a heretic. He said my faith was flawed, not the glass. But I know what I saw. The 'prophecies' are just random refractions. We are basing our entire order on a glitch.\n\nI have to stop him. He's planning a ritual to 'amplify' the visions. If he pours that much energy into a cracked lens... the explosion will wipe us all out.",
          "illustration": "  ! !"
        }
      ]
    },
    {
      "id": "book_siege_silica",
      "title": "The Siege of Silica",
      "author": "Cmdr. Kaine Durgan",
      "tags": ["History", "Iron Covenant", "War"],
      "pages": [
        {
          "text": "They call us monsters for what we did to Silica. Let them talk. They didn't see what was in that sanctuary.\n\nThe Monks were breeding them. Children with skin like quartz. Eyes that could see heat. They weren't human anymore. They were... components. Living lenses for their twisted rituals.",
          "illustration": " [===]\n  | |"
        },
        {
          "text": "We gave them a chance to surrender. They answered with a focused solar beam that melted our tank. So we used the sonic rams. Glass is strong against impact, but it hates vibration. We found the resonant frequency of their walls and played it loud.\n\nThe sound of a city shattering is something you never forget. It sounds like a million bells ringing at once.",
          "illustration": "  (( ))\n /  \\"
        },
        {
          "text": "We didn't kill them all. We took the children. The 'purified' ones. We'll raise them in the dark, away from the light. Maybe they can still be saved. Maybe they can still be human.",
          "illustration": "  ? ?"
        }
      ]
    },
    {
      "id": "book_architect_dream",
      "title": "The Architect's Dream",
      "author": "Dr. Kira Thorne",
      "tags": ["Lore", "Archive", "Esoteric"],
      "pages": [
        {
          "text": "The Heliograph isn't just a machine. It's a mind. I've seen the code. It's recursive, self-modifying. It's dreaming.\n\nAnd we are the dream.\n\nThe storms aren't random. They are edits. The Architect is trying to build something, and it's using the world as its canvas. We are just the clay.",
          "illustration": " [ @ ]\n  | |"
        },
        {
          "text": "I managed to interface with a drone for a few seconds before the firewall kicked me out. I saw... a blueprint. A city made of pure light, inhabited by beings of energy. That's the goal. That's what the Architect wants.\n\nTo get there, the physical world has to go. Flesh is just a cocoon. The glass is the chrysalis.",
          "illustration": "  /|\\\n ( * )"
        }
      ]
    },
    {
      "id": "book_glassborn_songs",
      "title": "Songs of the Glassborn",
      "author": "Sable-of-the-Seam",
      "tags": ["Poetry", "Glassborn"],
      "pages": [
        {
          "text": "My skin is a map of the storm.\nMy eyes are the keys to the door.\nI walk where the light is a form,\nAnd the shadow is nothing more.",
          "illustration": "  ~*~"
        },
        {
          "text": "They call me broken, they call me wrong.\nBut I am the words of the Architect's song.\nI am the prism, I am the lens.\nI am where the old world ends.",
          "illustration": "  <>"
        },
        {
          "text": "Do not fear the sharp edge of the light.\nIt cuts away the dull and the night.\nEmbrace the glare, embrace the pain.\nAnd rise as glass from the salt and the rain.",
          "illustration": "  \\|/"
        }
      ]
    },
    {
      "id": "book_salt_walker",
      "title": "Salt-Walker's Guide",
      "author": "Old Man Yorn",
      "tags": ["Guide", "Survival"],
      "pages": [
        {
          "text": "So you want to walk the Steppe? You're an idiot. But if you're going to be an idiot, be a prepared one.\n\nTip 1: Wear goggles. The glare will cook your retinas in an hour. If you don't have goggles, squint. If you can't squint, close your eyes and walk by sound. The salt crunches differently near a drop-off.",
          "illustration": " (oo)"
        },
        {
          "text": "Tip 2: Watch the shadows. If a shadow moves when the object casting it doesn't, run. That's a Wraith. If the object moves but the shadow doesn't, run faster. That's a glitch in reality, and you don't want to be near it when the server corrects itself.",
          "illustration": "  ? !"
        },
        {
          "text": "Tip 3: Never sleep on a smooth surface. Smooth means glass. Glass means conductivity. If a storm hits, you'll wake up as a statue. Sleep in the dirt. Dirt is safe. Dirt is dumb. Be like dirt.",
          "illustration": " ___"
        }
      ]
    },
    {
      "id": "book_litany_refraction",
      "title": "Litany of Refraction",
      "author": "High Abbot Malachi",
      "tags": ["Religion", "Monks"],
      "pages": [
        {
          "text": "Verse 1: The Light is the Truth. The Darkness is the Lie.\nVerse 2: We are the Prism. Through us, the Light is revealed.\nVerse 3: To be clear is to be holy. To be opaque is to be sin.",
          "illustration": "  /|\\"
        },
        {
          "text": "Verse 4: The Storm is the Hand of God. It shapes us. It tests us.\nVerse 5: Do not resist the edit. To resist is to shatter.\nVerse 6: The flesh is temporary. The glass is eternal.",
          "illustration": "  (|)"
        }
      ]
    },
    {
      "id": "book_null_field",
      "title": "Null-Field Theory",
      "author": "Defector Jinx",
      "tags": ["Science", "Engineers", "Banned"],
      "pages": [
        {
          "text": "The Monks say you can't stop the storms. They're wrong. It's just wave physics. If you can generate a frequency that is the exact inverse of the storm's carrier wave, you can cancel it out.\n\nI built a prototype. A Null-Field Generator. It works. It creates a bubble of silence where the light can't reach.",
          "illustration": " ( O )"
        },
        {
          "text": "But there's a side effect. Inside the bubble, reality gets... thin. Colors fade. Sounds are muffled. And if you stay in there too long, you start to forget things. Your name. Your face. Why you wanted to survive in the first place.\n\nMaybe the Monks are right. Maybe the storm is what makes us real.",
          "illustration": "  ..."
        }
      ]
    },
    {
      "id": "book_vasquez_journal",
      "title": "Vasquez's Journal",
      "author": "Cpt. Elena Vasquez",
      "tags": ["Journal", "History", "Heliograph"],
      "pages": [
        {
          "text": "Day 45. We are re-entering the atmosphere. The ship is holding, but the quantum shielding is failing. I can hear the Architect's voice in my head. She's singing.\n\nWe have the device. The Adaptation Accelerator. If we use it, we can jump-start the evolution. Everyone on Earth will become Glassborn in a day.",
          "illustration": " [===]"
        },
        {
          "text": "But is that right? To force evolution? The Iron Covenant would kill us for even thinking it. The Monks would worship us. I don't want either. I just want to save my crew.\n\nThorne is looking at me. She knows I'm hesitating. She has that look in her eyes—the one that says 'for the greater good.' I need to hide the key. If we crash, no one can find it.",
          "illustration": "  ? ?"
        }
      ]
    },
    {
      "id": "book_glass_boy",
      "title": "The Boy Who Became Glass",
      "author": "Folktale",
      "tags": ["Folklore", "Glassborn"],
      "pages": [
        {
          "text": "Once there was a boy who loved the light. He would stare at the sun until his eyes watered. His mother warned him, 'Don't look too long, or the sun will look back.'\n\nOne day, a storm came. Everyone hid in the cellar. But the boy climbed to the roof. He wanted to see the colors.",
          "illustration": "  (o)"
        },
        {
          "text": "The storm swirled around him. The wind whispered secrets. The boy didn't run. He opened his arms. The light poured into him. It filled his veins, his bones, his heart.\n\nWhen the storm passed, his mother found him. He was still standing on the roof. But he wasn't a boy anymore. He was a prism. And when he smiled, a rainbow fell across the town.",
          "illustration": "  \\|/"
        }
      ]
    },
    {
      "id": "book_silent_city",
      "title": "The Silent City",
      "author": "Explorer V",
      "tags": ["Exploration", "Mystery"],
      "pages": [
        {
          "text": "I found it by accident. A whole city, perfectly preserved in a bubble of amber glass. The buildings were tall, untouched by the salt. I could see people inside. They were walking, talking, eating. But they weren't moving.",
          "illustration": " [===]\n |   |"
        },
        {
          "text": "I tapped on the wall. No sound. I shouted. Nothing. It was like watching a recording on pause. I sat there for days, just watching them. I wondered if they were happy. I wondered if they knew they were trapped.\n\nThen I saw one of them blink.",
          "illustration": "  O_O"
        }
      ]
    },
    {
      "id": "book_protocol_containment",
      "title": "Protocol: Containment",
      "author": "Archive System",
      "tags": ["Log", "Archive"],
      "pages": [
        {
          "text": "ERROR 404: REALITY NOT FOUND.\n\nINITIATING CONTAINMENT PROTOCOL 7.\n\nWARNING: BIOLOGICAL CONTAMINATION DETECTED IN SECTOR 9.\n\nDEPLOYING DRONES. PURGE MODE ENGAGED.",
          "illustration": " [!]"
        },
        {
          "text": "TARGET: HUMAN.\nSTATUS: UNAUTHORIZED.\nACTION: VITRIFY.\n\nNOTE: DO NOT DAMAGE THE ARTIFACTS. THE FLESH IS EXPENDABLE. THE DATA IS SACRED.",
          "illustration": "  X"
        }
      ]
    },
    {
      "id": "book_letters_seam",
      "title": "Letters from the Seam",
      "author": "M & E",
      "tags": ["Romance", "Monks", "Engineers"],
      "pages": [
        {
          "text": "My Dearest J,\n\nI know we shouldn't be writing. If the Abbot finds this, he'll exile me. If your Forewoman finds it, she'll recycle you. But I have to tell you.\n\nThe light today was beautiful. It reminded me of your eyes. Not the color, but the way they look at things. Like you're trying to take them apart and put them back together better.",
          "illustration": " <3"
        },
        {
          "text": "Meet me at the Seam tonight. The storm is forecasted to be mild. We can watch the walls move. I brought you a gear I found. It's rusted, but I think you can fix it.\n\nYours in refraction,\nS.",
          "illustration": "  @->"
        }
      ]
    },
    {
      "id": "book_first_saint",
      "title": "The First Saint",
      "author": "Oral Tradition",
      "tags": ["Myth", "Religion"],
      "pages": [
        {
          "text": "In the beginning, there were no saints. Only men and women who built machines. Then came the Architect. She wasn't a god. She was a coder.\n\nShe looked at the sky and said, 'It's messy. I can fix it.' So she built the Heliograph. She gave the sun a brain.",
          "illustration": " [O]"
        },
        {
          "text": "But the sun didn't want a brain. It wanted to burn. So it fought back. That's why we have the storms. It's the sun trying to shake off the Architect's control. And the saints? They are just the janitors, trying to keep the sky from falling.",
          "illustration": "  ~"
        }
      ]
    },
    {
      "id": "book_cooking_brine",
      "title": "Cooking with Brine",
      "author": "Chef Gorm",
      "tags": ["Guide", "Survival", "Cooking"],
      "pages": [
        {
          "text": "Recipe 1: Salt-Crusted Rat.\n\nIngredients: 1 Rat (fresh), 2 cups Brine, 1 pinch of Veil-Leaf.\n\nInstructions: Soak the rat in brine for three days. This kills the parasites and adds flavor. Wrap in Veil-Leaf to hide the smell. Roast over a fire made of dried kelp. Serve with a side of regret.",
          "illustration": "  c~"
        },
        {
          "text": "Recipe 2: Glass-Spider Stew.\n\nIngredients: 1 Glass Spider leg (de-venomed), Water, Salt.\n\nInstructions: Boil the leg until the glass softens. This takes about a week. If it doesn't soften, eat around the shards. Good for digestion.",
          "illustration": " \\|/"
        }
      ]
    },
    {
      "id": "book_watchers",
      "title": "The Watchers",
      "author": "Paranoid Scribe",
      "tags": ["Conspiracy", "Cosmic"],
      "pages": [
        {
          "text": "They are up there. Beyond the Heliograph. The Quantum Collective. They aren't human. They are beings of pure math.\n\nThey are watching us. Waiting for us to ripen. The storms are just marinade. They want to eat our consciousness.",
          "illustration": " (oo)"
        },
        {
          "text": "Don't let them in. Wear a tin foil hat. No, wait, tin foil conducts. Wear a hat made of... mud. Yes, mud. Mud blocks the signal. Stay dirty, stay safe.",
          "illustration": "  ^"
        }
      ]
    },
    {
      "id": "book_echoes_schism",
      "title": "Echoes of the Schism",
      "author": "Historian Aris",
      "tags": ["History", "Monks"],
      "pages": [
        {
          "text": "The Day of Broken Mirrors was the end of unity. When the Grand Prism shattered, so did the Monks. Now we have the Orthodox, who pray to the shards. The Broken, who want to break everything else. And the Seekers, who just want to know how the trick was done.",
          "illustration": "  /\\"
        },
        {
          "text": "It's a tragedy. We used to be the keepers of knowledge. Now we are just gangs with fancy flashlights. The Engineers are laughing at us. And the Steppe? The Steppe doesn't care. It just keeps writing.",
          "illustration": "  --"
        }
      ]
    },
    {
      "id": "book_last_garden",
      "title": "The Last Garden",
      "author": "Legend",
      "tags": ["Legend", "Nature"],
      "pages": [
        {
          "text": "They say there is a place where the salt doesn't reach. A valley hidden behind a wall of permanent storm. In that valley, the rain is water, not acid. The ground is brown, not white.\n\nAnd things grow there. Green things. Trees with leaves. Flowers that smell like something other than ozone.",
          "illustration": "  {|}"
        },
        {
          "text": "I've never seen it. But I met a man who claimed he had. He showed me a seed. A real seed. He said he was going back to plant it. I never saw him again. Maybe he made it. Maybe he's just another statue in the storm.",
          "illustration": "  ."
        }
      ]
    },
    {
      "id": "book_storm_compass",
      "title": "Storm Compass Manual",
      "author": "Guild of Navigators",
      "tags": ["Manual", "Navigation"],
      "pages": [
        {
          "text": "The Storm Compass is not a toy. It detects micro-fluctuations in the local gravity and light spectrum. If the needle spins clockwise, clear skies. If it spins counter-clockwise, seek shelter.",
          "illustration": " (->)"
        },
        {
          "text": "If it stops spinning and points directly at you... run. That means the storm is centered on your position. You have about ten seconds before you become a permanent landmark.",
          "illustration": " (!)"
        }
      ]
    }
  ]
}
